[
    {
      "id": 0,
      "title": "Чистый код. Создание, анализ и рефакторинг",
      "author": "Роберт Мартин",
      "genre":[
        "Проф. литература"
      ],
      "annotation": "Плохой код может работать, но он будет мешать развитию проекта и компании-разработчика, требуя дополнительные ресурсы на поддержку и \"укрощение\".\nКаким же должен быть код? Эта книга полна реальных примеров, позволяющих взглянуть на код с различных направлений: сверху вниз, снизу вверх и даже изнутри. Вы узнаете много нового о коде. Более того, научитесь отличать хороший код от плохого, узнаете, как писать хороший код и как преобразовать плохой код в хороший.\nКнига состоит из трех частей. Сначала вы познакомитесь с принципами, паттернами и приемами написания чистого кода. Затем приступите к практическим сценариям с нарастающей сложностью - упражнениям по чистке кода или преобразованию проблемного кода в менее проблемный. И только после этого перейдете к самому важному - концентрированному выражению сути этой книги - набору эвристических правил и \"запахов кода\". Именно эта база знаний описывает путь мышления в процессе чтения, написания и чистки кода.",
      "publisher": "Питер, 2018 г",
      "stars": 5
    },
    {
      "id": 1,
      "title": "Тысячеликий герой",
      "author": "Джозеф Кэмпбелл",
      "genre":[
        "Психология",
        "История",
        "Антропология",
        "Этнография"
      ],
      "annotation": "С момента своего выхода эта легендарная книга разошлась миллионными тиражами во всем мире. Джозеф Кэмпбелл - известнейший антрополог, сравнительный психолог. В этой книге автор описывает путешествие героя, рассматривает универсальный мотив приключения и трансформации, которые отражены в мировой мифологической традиции. Джордж Лукас после выхода на экраны \"Звёздных войн\" в конце 1970- х годов заявил, что фильм был основан на идеях, описанных в \"Тысячеликом герое\" и других книгах Кэмпбелла.",
      "publisher": "Питер, 2018 г",
      "stars": 5
    },
    {
      "id": 2,
      "title": "Закон Чернобыля",
      "author": "Силлов Дмитрий Олегович",
      "genre":[
        "Фантастика",
        "Современная отечественная проза"
      ],
      "series": "",
      "annotation": "Американский полицейский Джек Томпсон, уже знакомый читателям по роману Дмитрия Силлова \"Закон проклятого\", никак не может забыть своих жену и дочь, погибших много лет назад. И вот однажды он узнает, что в далекой Чернобыльской Зоне некий академик Захаров при помощи артефактов оживляет давно умерших людей. И теперь единственной целью Томпсона становится добраться до Зоны и вернуть к жизни свою, казалось бы, навеки потерянную семью.\n",
      "publisher": "АСТ, 2021 г",
      "stars": 5
    },
    {
      "id": 3,
      "title": "Лес самоубийц",
      "author": "Джереми Бейтс",
      "genre":[
        "Фантастика",
        "Современная зарубежная фантастика",
        "Мистика"
      ],
      "series": "",
      "annotation": "У подножия горы Фудзи раскинулся мрачный и таинственный лес Аокигахара: густые кроны деревьев не пропускают солнечный свет, лианы скрывают предательские провалы, ни звука, ни ветерка не оживляет мрачный пейзаж. Есть поверье, что всех, кто попадает сюда, начинают преследовать духи мертвых. И горе незадачливым туристам, кто ради развлечения приходит в это зловещее место: их ждут страшные находки и смертельные испытания.\nПриятная прогулка обернется ночным кошмаром. И не все смогут живыми вернуться домой...",
      "publisher": "Аркадия, 2019 г",
      "stars": 5
    }
]
